def list_vmat_104_gr():
    list_vmat_104 = {
        'Авдеев Семен': '| + | + | 4 | н | + |',
        'Стрельцова Анна': '| + | + | + | + | 4 |',
        'Мелькова Елена': '| н | н | + | 5 | + |',
        'Юнусова Алина': '| + | 5 | 4 | + | + |',
    }
    return list_vmat_104


def list_inyaz_104_gr():
    list_inyaz_104 = {
        'Авдеев Семен': '| + | + | 5 | 5 |',
        'Стрельцова Анна': '| + | 4 | + | + |',
        'Мелькова Елена': '| + | н | + | 5 |',
        'Юнусова Алина': '| + | + | 4 | 5 |',
    }
    return list_inyaz_104


def list_vved_104_gr():
    list_vved_104 = {
        'Авдеев Семен': '| + | + | + |',
        'Стрельцова Анна': '| 4 | + | + |',
        'Мелькова Елена': '| + | + | 4 |',
        'Юнусова Алина': '| 5 | + | + |',
    }
    return list_vved_104


def list_vmat_203_gr():
    list_vmat_203 = {
        'Усманов Макар': '| + | + | н | + |',
        'Краснова Мария': '| + | + | + | 5 |',
        'Макаров Максим': '| + | 5 | 4 | + |',
        'Никулин Сергей': '| 4 | + | + | + |',
    }
    return list_vmat_203


def list_inyaz_203_gr():
    list_inyaz_203 = {
        'Усманов Макар': '| 5 | + | н | + | 5 |',
        'Краснова Мария': '| 5 | н | + | 5 | + |',
        'Макаров Максим': '| 4 | 5 | 4 | + | + |',
        'Никулин Сергей': '| 4 | 5 | + | + | + |',
    }
    return list_inyaz_203


def list_terver_203_gr():
    list_terver_203 = {
        'Усманов Макар': '| + | + | 5 | 5 | + |',
        'Краснова Мария': '| + | н | 4 | + | + |',
        'Макаров Максим': '| н | + | 5 | + | 5 |',
        'Никулин Сергей': '| + | + | 5 | н | + |',
    }
    return list_terver_203


def hw_vmat_104_gr():
    hw_vmat_104 = {
        '1': 'Курсовой проект - срок сдачи 10 неделя',
        '2': 'РГР №1 - срок сдачи 4 неделя',
        '3': 'РГР №2 - срок сдачи 8 неделя',
    }
    return hw_vmat_104


def hw_inyaz_104_gr():
    hw_inyaz_104 = {
        '1': 'Перевод текста по 1 семинару - срок сдачи 2 неделя',
        '2': 'Выучить слова по тексту 1 - срок сдачи 3 недел',
        '3': 'Перевод текста по 2 семинару - срок сдачи 4 неделя',
        '4': 'Тест по первому семинару - срок сдачи 4 неделя'
    }
    return hw_inyaz_104


def hw_vved_104_gr():
    hw_vved_104 = {
        '1': 'Реферат - срок сдачи 5 неделя',
        '2': 'Доклад - срок сдачи 8 неделя',
    }
    return hw_vved_104


def hw_vmat_203_gr():
    hw_vmat_203 = {
        '1': 'РГР №1 - срок сдачи 4 неделя',
        '2': 'КР №1 - 5 неделя',
        '3': 'РГР №2 - срок сдачи 8 неделя',
        '4': 'КР №2 - 9 неделя',
    }
    return hw_vmat_203


def hw_inyaz_203_gr():
    hw_inyaz_203 = {
        '1': 'Перевод текста по 1 семинару - срок сдачи 3 неделя',
        '2': 'Тест по первому семинару - срок сдачи 3 неделя',
        '3': 'Перевод текста по 2 семинару - срок сдачи 4 неделя',
    }
    return hw_inyaz_203


def hw_terver_203_gr():
    hw_terver_203 = {
        '1': 'РГР №1 - срок сдачи 5 неделя',
        '2': 'КР №1 - 6 неделя',
        '3': 'РГР №2 - срок сдачи 8 неделя'
    }
    return hw_terver_203
