def list_of_program():
    list_of_prog = {
        '21.05.06': ' Нефтегазовые техника и технологии   |  очная, заочная  |    М, РЯ, Ф',
        '20.05.01': ' Пожарная безопасность               |  очная, заочная  |    М, РЯ, Ф',
        '21.05.02': ' Прикладная геология                 |  очная           |    М, РЯ, Ф',
        '38.05.01': ' Экономическая безопасность          |  очная           |    М, РЯ, Общ',
        '13.03.02': ' Электроэнергетика и электротехника  |  очная, заочная  |    М, РЯ, Ф',
        '41.03.01': ' Зарубежное регионоведение           |  очная, заочная  |    РЯ, ИЯ, Общ'
    }
    return list_of_prog


def date_of_ent_exam():
    date_of_exam = {
        'Математика': ' 09.06.2023 11.00',
        'Русский язык': ' 13.06.2023 11.00',
        'Физика': ' 15.06.2023 11.00',
        'Обществознание': ' 19.06.2023 11.00',
        'Иностранный язык': ' 15.06.2023 11.00',
    }
    return date_of_exam


def min_score_of_exam():
    min_score = {
        'Математика': ' 39',
        'Русский язык': ' 40',
        'Физика': ' 45',
        'Обществознание': ' 42',
        'Иностранный язык': ' 40',
    }
    return min_score


def list_of_documents():
    list_of_doc = {
        '1': ' оригинал и ксерокопию документов, удостоверяющих личность, гражданство (обычно паспорт)',
        '2': ' документ об образовании (со вкладышем) или его ксерокопия (без заверения)',
        '3': ' документы, подтверждающие индивидуальные достижения поступающего',
        '4': ' копия СНИЛС',
        '5': ' 6 фотографий размером 3х4 см',
        '6': ' медицинскую справку по форме 086-У'
    }
    return list_of_doc
