def timetable():
    week_schedule = {
        'Пн 1 пара': ['Высшая математика', '104 группа', 'Иванов'],
        'Пн 2 пара': ['Иностранный язык', '203 группа', 'Петрова'],
        'Пн 3 пара': ['Введение в специальность', '104 группа', 'Васильева'],
        'Вт 2 пара': ['Высшая математика', '104 группа', 'Иванов'],
        'Вт 3 пара': ['Высшая математика', '203 группа', 'Иванов'],
        'Ср 1 пара': ['Иностранный язык', '104 группа', 'Петрова'],
        'Ср 2 пара': ['Иностранный язык', '203 группа', 'Петрова'],
        'Чт 2 пара': ['Теория вероятности', '203 группа', 'Иванов'],
        'Чт 3 пара': ['Высшая математика', '104 группа', 'Иванов'],
        'Чт 4 пара': ['Введение в специальность', '104 группа', 'Васильева'],
        'Пт 1 пара': ['Иностранный язык', '203 группа', 'Петрова'],
        'Пт 2 пара': ['Высшая математика', '203 группа', 'Иванов'],
        'Сб 3 пара': ['Иностранный язык', '104 группа', 'Петрова'],
    }
    return week_schedule
